{
	"floorcast": {
		"title": "FloorCast",
        "image": "/assets/images/floorcast-logo.jpg",
		"description": "During my final semester at the University of Michigan, I worked on a responsive web application that tallied the student traffic levels in the undergraduate library. The school provided my team with data through automated emails every five minutes. Those emails included the number of devices connected to each router in the building at a given that time. <br>Since there are three routers on each floor, we were able to estimate the number of people in each area of the building. A Java application was built to pull those numbers from the emails and add them to the database.<br>My role in the project was to develop the front end and framework of the application. I used Flask to pull the data and run the application, which was based on those numbers. I designed the front end using AxureRP and the front-end development used HTML/CSS and a few JavaScript libraries",
        "company": "personal",
		"date": "9/30/2014",
		"skills": "Flask, SQL, HTML, CSS, JS",
		"website": "floorcast.info",
        "thumbnail":"/assets/images/portfolio/floorcast/floorcast-thumbnail.jpg" 
	},
	"cchs": {
		"title": "Crawford County Historical Society Website",
        "image": "/assets/images/portfolio/cchs/cchs-exhibits.png",
		"description": "As part of the effort to increase museum traffic and raise money for the Crawford County Historical Society, I offered to revamp the society's website. The goal was to improve the digital presence and attract attention to the many historical exhibits and displays. <br>I used AxureRP to mock up the site and get feedback from the society’s board members before starting the development. The website is an angular application built with HTML5/Bootstrap3 and a document-oriented database. Lastly, the website uses PHP mailer for contact and newsletter submissions.<br>After the site went into production, I worked on improving the search engine optimization. Since the society was transitioning from one site to another, the Google business account, as well as several Crawford County area websites, needed to be updated. Site traffic has steadily increased since the launch of the site and the number of museum visitors is on the rise.",
        "company": "CCHS",
		"date": " 1/15/2017",
		"skills": "AngularJS, HTML, CSS, PHP, SEO, JSON",
		"website": "crawfordcountyhistoricalsociety.com",
        "thumbnail":"/assets/images/portfolio/cchs/cchs-thumbnail.jpg" 
	}, 
    "ifp": {
		"title": "Cigna Individual & Family Plans",
        "image": "/assets/images/portfolio/ifp/ifp-landing-full.png",
		"description": "Every year, Cigna holds its open enrollment period for individual and family plans between the months of October and January(?). As part of the preparation for this period, the website and plan details must be updated and ready for launch on Day 1. <br>For the 2016 launch, the most complex piece of this project was the plan finder application. We decided to move the back end from Java to AngularJS. I created a Python script to pull multiple excel sheets of data into one XML file. This allowed us to automate the effort versus completing it by hand, as has been done in the past. <br>In addition, I hand-coded a microsite for Illinois customers from a UI spec created by an external agency. I also created a script to generate Teamsite components from excel sheets and worked on various new pages and content updates",
        "company": "Cigna",
		"date": "10/1/2016",
		"skills": "HP Teamsite, Python, HTML, CSS, JS",
		"website": "cigna.com/individuals-families",
        "thumbnail":"/assets/images/portfolio/ifp/ifp-thumbnail.jpg" 
	}, 
    "medicare": {
		"title": "Cigna Medicare 2017",
        "image": "/assets/images/portfolio/medicare/medicare-plan-finder.png",
		"description": "Every year, the Cigna HealthSpring/Medicare website needs to be updated with the annual plans and content in order to provide customers with accurate information and stay compliant with the Center of Medicare and Medicaid Services. For this project, we worked with our HealthSpring partners in Nashville to prepare the website for launch on October 1, 2016. <br>In previous years, the data was managed on several spreadsheets and converted into a single JSON file using excel formulas, which was tedious and vulnerable to error. To expedite this process and ensure accuracy, I created a python script that took the data from various data spreadsheets and converted it into JSON, which was then used by the plan finder Angular application.<br>I also provided content updates and defect correction leading up to the release.",
        "company": "Cigna",
		"date": "11/1/2016",
		"skills": "HP Teamsite, Python, JSON",
		"website": "cigna.com/medicare",
        "thumbnail":"/assets/images/portfolio/medicare/medicare-thumbnail.jpg" 
	},
    "hongkong": {
		"title": "Cigna Hong Kong",
        "image": "/assets/images/portfolio/hongkong/hk-landing-cn.png",
		"description": "One of Cigna’s biggest IT projects in Q4 2016 was to migrate the Cigna Hong Kong site onto the HP Teamsite Content Manager.As part of this effort, which required a significant amount of collaboration between the U.S. and Hong Kong teams, we revamped the Hong Kong site with a brand new UI/UX experience and added new pages.<br>My primary role on this project was to update the content and the user interface to meet the business requirements, which continuously changed during the development process. I also worked on defect correction for the site to address the issues identified by our Quality Assurance team and the Business team in Hong Kong.",
        "company": "Cigna",
		"date": "12/16/2016",
		"skills": "HTML, CSS, XSL, HP Teamsite",
		"website": "cigna.com.hk",
        "thumbnail":"/assets/images/portfolio/hongkong/hongkong-thumbnail.jpg" 
	},
    "dxs": {
		"title": "Cigna Digital Experience Standards",
        "image": "/assets/images/portfolio/dxs/dxs-thumbnail.png",
		"description": "In October 2016, a project came from the Global Vice President of Digital Marketing. She wanted a more 'accessible, customer-centric, insights driven end-to-end digital experience for tens of millions of users'. As a result, the standards become our number one priority. <br> Working with the Digital Marketing team and an external agency, I took on the role as lead developer for this project. We recieved the code from the agency, and it was my task to turn that code in to Teamsite components and pages.<br>Once the site was launched, I worked on the User Experience Team to further improve the content and UI, as well as keep the stardards accurate and up-to-date.",
        "company": "Cigna",
		"date": "1/19/2017",
		"skills": "HTML, CSS, XSL, HP Teamsite",
		"website": "Internal Site",
        "thumbnail":"/assets/images/portfolio/dxs/dxs-thumbnail.jpg" 
	}
    
}